#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambdaLayer.null_resource.lambda_layer: Refreshing state... [id=8008652572958733153]
module.lambdaFunction.data.archive_file.lambda: Reading...
module.lambdaFunction.data.archive_file.lambda: Read complete after 0s [id=c85bcc4be25fa90eff5c1d1d03054f82fc7fa05a]
module.lambdaFunction.data.aws_iam_policy_document.lambda_policy: Reading...
module.lambdaFunction.data.aws_iam_policy_document.lambda_assume_role: Reading...
module.lambdaFunction.data.aws_iam_policy_document.lambda_policy: Read complete after 0s [id=3971348516]
module.s3bucket.aws_s3_bucket.etl_bucket: Refreshing state... [id=real-estate-etl-101]
module.lambdaFunction.data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
module.lambdaLayer.aws_s3_bucket.lambda_layer_bucket: Refreshing state... [id=my-lambda-layer-bucket-001]
module.lambdaFunction.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.lambdaFunction.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::623838372493:policy/lambda-policy]
module.lambdaFunction.aws_iam_role_policy_attachment.attach_getObject: Refreshing state... [id=iam_for_lambda-20240429121738484200000001]
module.s3bucket.aws_s3_object.std_zone: Refreshing state... [id=std_data/]
module.s3bucket.aws_s3_object.raw_zone: Refreshing state... [id=raw_data/]
module.lambdaLayer.aws_s3_object.lambda_layer_zip: Refreshing state... [id=lambda_layer/my_lambda_requirements_layer/requirements.zip]
module.lambdaLayer.aws_lambda_layer_version.my-lambda-layer: Refreshing state... [id=arn:aws:lambda:eu-west-3:623838372493:layer:my_lambda_requirements_layer:20]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lambdaFunction.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_function_extract_data.zip"
      + function_name                  = "lambda_extract_fromAPI"
      + handler                        = "extract_data.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:eu-west-3:623838372493:layer:my_lambda_requirements_layer:20",
        ]
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::623838372493:role/iam_for_lambda"
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "soYa9xGeIVYHdssp+VnRJQG5sBuBIrulz4Ell2txlYo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_HOST"   = "zillow56.p.rapidapi.com"
              + "API_KEY"    = "c7d66d4175msh4b730460e56d07dp177281jsn66cc27e2b144"
              + "DST_BUCKET" = "real-estate-etl-101"
              + "RAW_FOLDER" = "raw_data"
              + "REGION"     = "eu-west-3"
            }
        }
    }

  # module.lambdaFunction.aws_lambda_permission.s3 will be created
  + resource "aws_lambda_permission" "s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::real-estate-etl-101"
      + statement_id        = "AllowExecutionFromS3Bucket"
      + statement_id_prefix = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @g-lorena, Action: `pull_request`*